Repository: pneumatic-ilyacedrik/pneumaticworkflow
Catalog: core/processes/locale/*/LC_MESSAGES/django.po
Languages: es

source: You can't pass "snooze" for the first step.
es: No puedes pasar "posponer" en el primer paso.

source: You should set task performers before setting template to active.
es: Debe asignar los ejecutores de tareas antes de activar la plantilla.

source: One or more performers are repeated.
es: Uno o más artistas están repetidos.

source: Some fields in the task "{name}" conditions don't exist or are used before assignment.
es: Algunos campos en las condiciones de la tarea "{name}" no existen o se utilizan antes de ser asignados.

source: Selections can't be empty on radio or checkbox fields.
es: Las selecciones no pueden estar vacías en los campos de radio o casilla de verificación.

source: A field with a type 'User' should be required.
es: Un campo con el tipo 'Usuario' debe ser obligatorio.

source: Workflow template name is empty.
es: El nombre de la plantilla de flujo de trabajo está vacío.

source: Some of fields in "workflow template name" field(s) don't exist.
es: Algunos de los campos en el(los) campo(s) "nombre de la plantilla de flujo de trabajo" no existen.

source: If a "workflow template name" contains only an output fields,at least one of the fields must be required.
es: Si un "nombre de plantilla de flujo de trabajo" contiene solo campos de salida, al menos uno de los campos debe ser obligatorio.

source: Kickoff form data not provided.
es: Datos del formulario de inicio no proporcionados.

source: Kickoff form 'id' has incorrect value.
es: El formulario de inicio 'id' tiene un valor incorrecto.

source: Kickoff 'id' not provided.
es: Inicio de 'id' no proporcionado.

source: Tasks data not provided, one task required.
es: Datos de tareas no proporcionados, se requiere una tarea.

source: Incorrect tasks order.
es: Orden de tareas incorrecta.

source: You should set 'template owners' value.
es: Debes establecer el valor de 'propietarios de la plantilla'.

source: You cannot remove yourself from template owners.
es: No puede eliminarse a sí mismo de los propietarios de la plantilla.

source: One or more template owners are incorrect.
es: Uno o más propietarios de plantillas son incorrectos.

source: "Public success url" is an invalid format.
es: El formato de "Public success url" no es válido.

source: Filters 'with_tasks_in_progress' and 'workflows_status'cannot be used at the same time.
es: Los filtros 'with_tasks_in_progress' y 'workflows_status' no pueden usarse al mismo tiempo.

source: Permission denied. You are not a template owner.
es: Permiso denegado. No eres el propietario de la plantilla.

source: Inconsistent permission! Should use only for "workflow detail" actions.
es: ¡Permiso inconsistente! Debe usarse solo para acciones de "detalle de flujo de trabajo".

source: The limit for creating a public id has been exceeded.
es: El límite para crear una identificación pública ha sido superado.

source: The limit for creating a embed id has been exceeded.
es: Se ha superado el límite para crear un ID de inserción.

source: Expected date field api_name.
es: Campo de fecha esperada api_name.

source: Only the date fields from previous steps can be used in a due date.
es: Solo se pueden utilizar los campos de fecha de los pasos anteriores en una fecha de vencimiento.

source: Expected task api_name.
es: Tarea esperada api_name.

source: Only previous steps are allowed for a rule.
es: Solo se permiten pasos anteriores para una regla.

source: Only previous and current steps are allowed for a rule.
es: Solo se permiten pasos anteriores y actuales para una regla.

source: You should set the user id for performer with the type "user".
es: Deberías establecer el ID de usuario para el ejecutante con el tipo "usuario".

source: Performer "id" should be a number.
es: El "id" del intérprete debe ser un número.

source: One or more performers are incorrect.
es: Uno o más intérpretes son incorrectos.

source: A template with "Workflow starter" in the list of performers can not be shared. Please replace the "workflow starter" with another team member.
es: Un modelo con "Iniciador del flujo de trabajo" en la lista de ejecutores no se puede compartir. Por favor, reemplace el "iniciador del flujo de trabajo" con otro miembro del equipo.

source: You should set the field api_name for performer with the type "field".
es: Deberías establecer el campo api_name para el ejecutante con el tipo "field".

source: Step {number}: Some fields in the step description don't exist or are used before assignment.
es: Paso {number}: Algunos campos en la descripción del paso no existen o se utilizan antes de ser asignados.

source: Step {number}: Field in step name don't exist or are used before assignment.
es: Paso {number}: El campo en el nombre del paso no existe o se usa antes de asignarlo.

source: Step {number}: If a step name contains only an output fields, at least one of the fields must be required.
es: Paso {number}: Si el nombre de un paso contiene solo campos de salida, al menos uno de los campos debe ser obligatorio.

source: Checklist items not exists or invalid.
es: Elementos de la lista de verificación no existen o son inválidos.

source: You can't change api_name of an existing object. Old value: "{old}", new value: "{new}".
es: No se puede cambiar el api_name de un objeto existente. Valor anterior: "{old}", valor nuevo: "{new}".

source: Task "{task}": user id "{user_id}" doesn't exist or can't be used in this condition.
es: Tarea "{task}": el ID de usuario "{user_id}" no existe o no se puede usar en esta condición.

source: Task "{task}": operator "{operator}" can't be use with type of field "{field_type}".
es: Tarea "{task}": el operador "{operator}" no se puede usar con el tipo de campo "{field_type}".

source: Task "{task}": selection "{selection_api_name}" doesn't exist or can't be used in this condition.
es: Tarea "{task}": la selección "{selection_api_name}" no existe o no se puede usar en esta condición.

source: Task "{task}": operator "{operator}" should have some value.
es: Tarea "{task}": el operador "{operator}" debe tener algún valor.

source: Step "{step_name}": checklist contains a non-unique api_name "{api_name}". Recreate checklist or change it's api_name.
es: Paso "{step_name}": la lista de verificación contiene un api_name no único "{api_name}". Vuelva a crear la lista de verificación o cambie su api_name.

source: Step "{step_name}": checklist item contains a non-unique api_name "{api_name}". Recreate checklist item or change it's api_name.
es: Paso "{step_name}": el elemento de la lista de verificación contiene un api_name no único "{api_name}". Vuelva a crear el elemento de la lista de verificación o cambie su api_name.

source: Step "{step_name}": condition contains a non-unique api_name "{api_name}". Recreate condition or change it's api_name.
es: Paso "{step_name}": la condición contiene un api_name no único "{api_name}". Vuelve a crear la condición o cambia su api_name.

source: {step_name}: output field "{name}" contains a non-unique api_name "{api_name}". Change the api_name or recreate output field.
es: {step_name}: el campo de salida "{name}" contiene un api_name no único "{api_name}". Cambia el api_name o vuelve a crear el campo de salida.

source: Step "{step_name}": condition predicate contains a non-unique api_name "{api_name}". Recreate condition predicate or change it's api_name.
es: Paso "{step_name}": el predicado de la condición contiene un api_name no único "{api_name}". Vuelva a crear el predicado de la condición o cambie su api_name.

source: Step "{step_name}": due date contains a non-unique api_name "{api_name}". Recreate due date or change it's api_name.
es: Paso "{step_name}": la fecha de vencimiento contiene un api_name no único "{api_name}". Vuelva a crear la fecha de vencimiento o cambie su api_name.

source: Step "{step_name}": condition rule contains a non-unique api_name "{api_name}". Recreate condition rule or change it's api_name.
es: Paso "{step_name}": la regla de condición contiene un api_name no único "{api_name}". Vuelva a crear la regla de condición o cambie su api_name.

source: {step_name}: output field "{name}" option "{value}" contains a non-unique api_name "{api_name}". Change the api_name or recreate option.
es: {step_name}: el campo de salida "{name}" opción "{value}" contiene un api_name no único "{api_name}". Cambia el api_name o vuelve a crear la opción.

source: Step "{step_name}": contains a non-unique api_name "{api_name}". Recreate step or change it's api_name.
es: Paso "{step_name}": contiene un api_name no único "{api_name}". Recree el paso o cambie su api_name.

source: Step "{step_name}": performer contains a non-unique api_name "{api_name}". Recreate performer or change it's api_name.
es: Paso "{step_name}": el ejecutante contiene un api_name no único "{api_name}". Vuelva a crear el ejecutante o cambie su api_name.

source: Duplicate template owners in the add owners request.
es: Propietarios de plantilla duplicados en la solicitud de agregar propietarios.

source: The owners passed in for template "{step_name}" contain a non-unique api_name: "{api_name}". Please change the non-unique api_name, or supply different owners.
es: Los propietarios enviados para la plantilla "{step_name}" contienen un api_name no único: "{api_name}". Por favor, cambie el api_name duplicado o proporcione propietarios diferentes.

source: Saving files is not available, file storage does't configured. Contact support.
es: Guardar archivos no está disponible, el almacenamiento de archivos no está configurado. Contacte con soporte.

source: Only "snoozed" workflows can be resumed.
es: Solo se pueden reanudar los flujos de trabajo "pospuestos".

source: You need to resume the workflow before completing the task.
es: Debe reanudar el flujo de trabajo antes de completar la tarea.

source: Task is skipped and cannot be completed.
es: La tarea se ha omitido y no se puede completar.

source: Check off all the items in the checklist before completing the task.
es: Marque todos los elementos en la lista de verificación antes de completar la tarea.

source: You have already completed this task.
es: Ya has completado esta tarea.

source: You have already completed this workflow.
es: Ya has completado este flujo de trabajo.

source: You are not allowed to finish this workflow.
es: No tienes permiso para finalizar este flujo de trabajo.

source: Task already completed.
es: Tarea ya completada.

source: You don't have permission for complete the task.
es: No tienes permiso para completar la tarea.

source: The supplied task number is incorrect.
es: El número de tarea proporcionado es incorrecto.

source: The user with the specified credentials not found.
es: El usuario con las credenciales especificadas no fue encontrado.

source: You have reached the limit of the number of guest performers.
es: Has alcanzado el límite del número de artistas invitados.

source: Deleting the last performer is not allowed.
es: Eliminar al último intérprete no está permitido.

source: Completed workflow cannot be changed.
es: El flujo de trabajo completado no se puede cambiar.

source: Available for current task only.
es: Disponible solo para la tarea actual.

source: You need to be added to the task as a performer to check off this checklist item.
es: Necesitas ser añadido a la tarea como ejecutante para marcar este elemento de la lista de verificación.

source: You need to resume the workflow before check off this checklist item.
es: Debe reanudar el flujo de trabajo antes de marcar este elemento de la lista de verificación.

source: Permission denied.
es: Permiso denegado.

source: Please fill in the required fields.
es: Por favor, complete los campos obligatorios.

source: Wrong argument format: "{arg}".
es: Formato de argumento incorrecto: "{arg}".

source: Value should be a string.
es: El valor debe ser una cadena.

source: The value of the field exceeds the limit of {limit} characters.
es: El valor del campo supera el límite de {limit} caracteres.

source: Selection with the given id does not exist.
es: Selección con el id proporcionado no existe.

source: Checkbox value should be a list.
es: El valor de la casilla de verificación debe ser una lista.

source: Checkbox value contains invalid selections.
es: Valor de la casilla contiene selecciones no válidas.

source: Checkbox value contains non existent selections.
es: El valor de la casilla de verificación contiene selecciones inexistentes.

source: The date value must be an integer or a floating-point number.
es: El valor de la fecha debe ser un número entero o de coma flotante.

source: URL field value should be a string.
es: El valor del campo URL debe ser una cadena.

source: The URL is invalid.
es: La URL no es válida.

source: File value should be a list of integers.
es: El valor del archivo debe ser una lista de enteros.

source: Attachment not found.
es: Adjunto no encontrado.

source: The value must be the ID of an existing account user.
es: El valor debe ser el ID de un usuario de cuenta existente.

source: Account user with given id does not exist.
es: Usuario de cuenta con el ID proporcionado no existe.

source: Save attachments failed. Service unavailable.
es: Error al guardar los archivos adjuntos. Servicio no disponible.

source: Blob object doesn't exist.
es: El objeto Blob no existe.

source: AI service is temporarily unavailable.
es: El servicio de IA no está disponible temporalmente.

source: Could not create template from given description.
es: No se pudo crear la plantilla a partir de la descripción proporcionada.

source: You've reached the limit for free AI powered template generation requests, sign up for a premium account to get unlimited access.
es: Has alcanzado el límite de solicitudes gratuitas para la generación de plantillas impulsadas por IA. Regístrate para obtener una cuenta premium y acceder sin restricciones.

source: Something seems to be wrong with your input, please try re phrasing your process name and description.
es: Parece que hay un problema con su entrada, por favor intente reformular el nombre y la descripción de su proceso.

source: You need to set up a system prompt for template generation. Contact administrator.
es: Necesitas configurar un mensaje del sistema para la generación de plantillas. Contacta al administrador.

source: You need to specify the comment text or attachments.
es: Debe especificar el texto del comentario o los archivos adjuntos.

source: You cannot write a comment on a completed workflow.
es: No puedes escribir un comentario en un flujo de trabajo completado.

source: You cannot change a deleted comment.
es: No puedes cambiar un comentario eliminado.

source: The size limit for attachments is {mb} Mb.
es: El límite de tamaño para los archivos adjuntos es de {mb} Mb.

source: Due date should be greater than current.
es: La fecha de vencimiento debe ser posterior a la actual.

source: Field with type "User" should be required.
es: Campo con tipo "Usuario" debe ser obligatorio.

source: The default value for a field with type "User" should be an integer.
es: El valor predeterminado para un campo de tipo "Usuario" debe ser un número entero.

source: The user for a field with type "User" does not exist.
es: El usuario para un campo con tipo "Usuario" no existe.

source: Field selections not provided.
es: Selección de campos no proporcionada.

source: Checklist element length limit exceeded. Limit 2000 chars.
es: Límite de longitud del elemento de la lista de verificación excedido. Límite de 2000 caracteres.

source: Filter by "assigned_to" is only allowed for the admin.
es: Filtrar por "asignado_a" solo está permitido para el administrador.

source: Checklist item with given id not found.
es: Elemento de la lista de verificación con el ID proporcionado no encontrado.

source: You can't pass the `id` field.
es: No puedes pasar el campo `id`.

source: Radio and checkbox fields must have non-empty selections.
es: Los campos de radio y casilla de verificación deben tener selecciones no vacías.

source: Value should be a object.
es: El valor debe ser un objeto.

source: Value should be a list.
es: El valor debe ser una lista.

source: Incorrect order of tasks.
es: Orden incorrecto de tareas.

source: Some fields in tasks descriptions don't exist or are used before assignment. Tasks number(s): {tasks_numbers}.
es: Algunos campos en las descripciones de las tareas no existen o se utilizan antes de la asignación. Número(s) de tarea(s): {tasks_numbers}.

source: You must pass an "api_name" into every field you declare.
es: Debe pasar un "api_name" en cada campo que declare.

source: Your template is disabled. Please, enable this template before running.
es: Su plantilla está deshabilitada. Por favor, habilite esta plantilla antes de ejecutarla.

source: Only "in-progress" workflows can be filtered by current performer.
es: Solo los flujos de trabajo "en progreso" pueden ser filtrados por el ejecutor actual.

source: You can't snooze the first task in a workflow.
es: No puedes posponer la primera tarea en un flujo de trabajo.

source: The task can't be completed until all the embedded workflows are done.
es: La tarea no se puede completar hasta que se hayan finalizado todos los flujos de trabajo integrados.

source: The task can't be returned until all the embedded workflows are done.
es: La tarea no se puede devolver hasta que se completen todos los flujos de trabajo integrados.

source: Snoozed workflow cannot be changed.
es: El flujo de trabajo pospuesto no se puede cambiar.

source: Completed task cannot be changed.
es: La tarea completada no se puede cambiar.

source: Creation of a embedded workflows is available only to the current task of workflow.
es: La creación de flujos de trabajo integrados está disponible solo para la tarea actual del flujo de trabajo.

source: You need to be added to the task as a performer in order to create a embedded workflows.
es: Debe ser agregado a la tarea como ejecutante para poder crear flujos de trabajo integrados.

source: You need to pass in a "task_id", or a "task api_name".
es: Debes proporcionar un task "id" o un task "api_name".

source: The passed in task was not found in the workflow.
es: La tarea proporcionada no se encontró en el flujo de trabajo.

source: You can't revert from the first task.
es: No puedes revertir desde la primera tarea.

source: Unable return to "{task_name}" because it was skipped by a condition.
es: No es posible volver a "{task_name}" porque se omitió debido a una condición.

source: Unable return to "{task_name}", because it was skipped by a condition (as were all the tasks before it).
es: No es posible volver a"{task_name}" porque se omitió debido a una condición (igual que todas las tareas anteriores).

source: A workflow can't return to a later task.
es: Un flujo de trabajo no puede regresar a una tarea posterior.

source: Step "{step_name}": The "Return to" setting refers to a task that doesn't exist (API name: "{api_name}").
es: Paso "{step_name}": La opción "Volver a" hace referencia a una tarea que no existe (nombre de la API: "{api_name}").

source: The task "{step_name}" cannot be set to return to itself.
es: La tarea "{step_name}" no puede configurarse para volver a sí misma.

source: There is no group with the specified ID.
es: No existe ningún grupo con el ID especificado.

source: You must supply a comment.
es: Debe proporcionar un comentario.
