Repository: pneumatic-ilyacedrik/pneumaticworkflow
Catalog: backend/src/notifications/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Reacted {reaction} to your comment
fr: Réagi avec {reaction} à votre commentaire

source: You have a new task
fr: Vous avez une nouvelle tâche

source: Task was returned
fr: Tâche renvoyée

source: Your task is overdue
fr: Votre tâche est en retard.

source: You have been mentioned
fr: Vous avez été mentionné

source: You have a new comment
fr: Vous avez un nouveau commentaire

source: Workflow was snoozed
fr: Le flux de travail a été mis en veille

source: Workflow was resumed
fr: Le flux de travail a été repris

source: Task due date was changed
fr: La date d'échéance de la tâche a été modifiée

source: Workflow: {workflow_name} Task: {task_name}
fr: Flux de travail : {workflow_name} Tâche : {task_name}

source: Task was completed
fr: Tâche terminée

source: You have unread notifications
fr: Vous avez des notifications non lues

source: Password reset
fr: Réinitialisation du mot de passe
