Repository: pneumatic-ilyacedrik/pneumaticworkflow
Catalog: core/notifications/locale/*/LC_MESSAGES/django.po
Languages: de, ru

source: Reacted {reaction} to your comment
de: Reagierte mit {reaction} auf deinen Kommentar
ru: {reaction} отреагировал(а) на ваш комментарий

source: You have a new task
de: Sie haben eine neue Aufgabe.
ru: У вас новая задача

source: Task was returned
de: Aufgabe wurde zurückgegeben
ru: Задача была возвращена

source: Your task is overdue
de: Ihre Aufgabe ist überfällig.
ru: Ваша задача просрочена

source: You have been mentioned
de: Sie wurden erwähnt
ru: Вас упомянули

source: You have a new comment
de: Sie haben einen neuen Kommentar.
ru: У вас новый комментарий

source: Workflow was snoozed
de: Arbeitsablauf wurde pausiert
ru: Процесс был отложен

source: Workflow was resumed
de: Arbeitsablauf wurde fortgesetzt
ru: Процесс был возобновлен

source: Task due date was changed
de: Fälligkeitsdatum der Aufgabe wurde geändert
ru: Дата выполнения задачи была изменена

source: Workflow: {workflow_name} Task: {task_name}
de: Arbeitsablauf: {workflow_name} Aufgabe: {task_name}
ru: Рабочий процесс: {workflow_name} Задача: {task_name}

source: Task was completed
de: Aufgabe wurde abgeschlossen
ru: Задача завершена

source: You have unread notifications
de: Sie haben ungelesene Benachrichtigungen
ru: У вас есть непрочитанные уведомления

source: Password reset
de: Passwort zurücksetzen
ru: Сброс пароля
