Repository: pneumatic-ilyacedrik/pneumaticworkflow
Catalog: core/pneumatic_backend/processes/locale/*/LC_MESSAGES/django.po
Languages: de, ru

source: Checklist item with given id not found.
de: Checklistenpunkt mit der angegebenen ID nicht gefunden.
ru: Элемент чек-листа с данным идентификатором не найден.

source: You can't pass the `id` field.
de: Sie können das Feld `id` nicht übergeben.
ru: Нельзя применять поле "id".

source: Radio and checkbox fields must have non-empty selections.
de: Radio- und Kontrollkästchenfelder müssen nicht-leere Auswahlen haben.
ru: Поля с радиокнопками и флажками должны иметь непустые значения.

source: Value should be a object.
de: Wert sollte ein Objekt sein.
ru: Значение должно быть объектом.

source: Value should be a list.
de: Der Wert sollte eine Liste sein.
ru: Значение должно быть списком.

source: Incorrect order of tasks.
de: Falsche Reihenfolge der Aufgaben.
ru: Неверный порядок задач.

source: Some fields in tasks descriptions don't exist or are used before assignment. Tasks number(s): {tasks_numbers}.
de: Einige Felder in den Aufgabenbeschreibungen existieren nicht oder werden vor der Zuweisung verwendet. Aufgabennummer(n): {tasks_numbers}.
ru: Некоторые поля в описаниях задач не существуют или используются до назначения. Задача: {tasks_numbers}

source: You must pass an "api_name" into every field you declare.
de: Sie müssen ein "api_name" in jedes Feld einfügen, das Sie deklarieren.
ru: Вы должны передать 'api_name' в каждое поле, которое вы объявляете.

source: Your template is disabled. Please, enable this template before running.
de: Ihre Vorlage ist deaktiviert. Bitte aktivieren Sie diese Vorlage, bevor Sie fortfahren.
ru: Ваш шаблон отключен. Пожалуйста, включите этот шаблон перед запуском.

source: Only "in-progress" workflows can be filtered by current performer.
de: Nur "in Bearbeitung" befindliche Workflows können nach aktuellem Ausführenden gefiltert werden.
ru: Только процессы в статусе "в процессе" могут быть отфильтрованы по текущему исполнителю.

source: You can't snooze the first task in a workflow.
de: Sie können die erste Aufgabe in einem Workflow nicht verschieben.
ru: Вы не можете поставить на паузу первую задачу в процессе.

source: The task can't be completed until all the embedded workflows are done.
de: Die Aufgabe kann nicht abgeschlossen werden, bis alle eingebetteten Workflows erledigt sind.
ru: Задача не может быть завершена до завершения всех встроенных процессов.

source: The task can't be returned until all the embedded workflows are done.
de: Die Aufgabe kann erst zurückgegeben werden, wenn alle eingebetteten Arbeitsabläufe abgeschlossen sind.
ru: Задача не может быть возвращена, пока все встроенные рабочие процессы не завершены.

source: Snoozed workflow cannot be changed.
de: Schlummernder Workflow kann nicht geändert werden.
ru: Отложенный рабочий процесс не может быть изменен.

source: Completed task cannot be changed.
de: Abgeschlossene Aufgabe kann nicht geändert werden.
ru: Выполненная задача не может быть изменена.

source: Creation of a embedded workflows is available only to the current task of workflow.
de: Erstellung eingebetteter Workflows ist nur für die aktuelle Aufgabe des Workflows verfügbar.
ru: Создание встроенных процессов доступно только для текущей задачи рабочего процесса.

source: You need to be added to the task as a performer in order to create a embedded workflows.
de: Sie müssen der Aufgabe als Ausführender hinzugefügt werden, um eingebettete Arbeitsabläufe zu erstellen.
ru: Вам необходимо быть исполнителем в задаче, чтобы создать встроенные процессы.

source: You need to pass in a "task_id", or a "task api_name".
de: Sie müssen eine task "id" oder einen task "api_name" übergeben.
ru: Необходимо передать task "id" или "api_name" задачи

source: The passed in task was not found in the workflow.
de: Die übergebene Aufgabe wurde im Workflow nicht gefunden.
ru: Указанная задача не найдена среди задач процесса.

source: You can't revert from the first task.
de: Sie können nicht von der ersten Aufgabe aus zurückspringen.
ru: Нельзя вернуться с первой задачи.

source: Unable return to "{task_name}" because it was skipped by a condition.
de: Eine Rückkehr zu "{task_name}", ist nicht möglich, da sie aufgrund einer Bedingung übersprungen wurde.
ru: Нелья вернутья к задаче "{task_name}", т.к задача пропускается по условию.

source: Unable return to "{task_name}", because it was skipped by a condition (as were all the tasks before it).
de: Eine Rückkehr zu "{task_name}", ist nicht möglich, da sie aufgrund einer Bedingung übersprungen wurde (wie auch alle vorherigen Aufgaben).
ru: Нельзя вернутья к задаче "{task_name}", т.к задача пропускается по условию (и все предыдущие задачи тоже).

source: A workflow can't return to a later task.
de: Ein Workflow kann nicht zu einer späteren Aufgabe zurückkehren.
ru: Нельзя вернуться к одной из будущих задач.

source: Step "{step_name}": The "Return to" setting refers to a task that doesn't exist (API name: "{api_name}").
de: Schritt "{step_name}": Die Einstellung "Zurück zu" verweist auf eine nicht existierende Aufgabe (API-Name: "{api_name}").
ru: Шаг "{step_name}": Параметр "Вернуться к" ссылается на несуществующую задачу (API-имя: "{api_name}").

source: The task "{step_name}" cannot be set to return to itself.
de: Die Aufgabe "{step_name}" kann nicht auf sich selbst zurückgesetzt werden.
ru: Задача "{step_name}" не может быть возвращена на саму себя.

source: You must supply a comment.
de: Sie müssen einen Kommentar angeben.
ru: Необходимо оставить комментарий.
