Repository: pneumatic-ilyacedrik/pneumaticworkflow
Catalog: core/pneumatic_backend/processes/locale/*/LC_MESSAGES/django.po
Languages: de, ru

source: You can't pass "snooze" for the first step.
de: Sie können "Schlummern" nicht für den ersten Schritt verwenden.
ru: Вы не можете пропустить или приостановить первую задачу в процессе.

source: You should set task performers before setting template to active.
de: Sie sollten die Aufgabenbearbeiter festlegen, bevor Sie die Vorlage aktivieren.
ru: Нужно указать исполнителей задач перед там как активировать шаблон.

source: One or more performers are repeated.
de: Ein oder mehrere Darsteller sind doppelt vorhanden.
ru: Один или несколько исполнителей повторяются.

source: Some fields in the task "{name}" conditions don't exist or are used before assignment.
de: Einige Felder in den Bedingungen der Aufgabe "{name}" existieren nicht oder werden vor der Zuweisung verwendet.
ru: Некоторые поля в условиях задачи "{name}" не существуют или используются до назначения.

source: Selections can't be empty on radio or checkbox fields.
de: Auswahlen dürfen bei Radio- oder Kontrollkästchenfeldern nicht leer sein.
ru: Значения в полях радио или чекбоксов не могут быть пустыми.

source: A field with a type 'User' should be required.
de: Ein Feld vom Typ 'Benutzer' sollte erforderlich sein.
ru: Поле с типом "Пользователь" должно быть обязательным.

source: Workflow template name is empty.
de: Der Name der Workflow-Vorlage ist leer.
ru: Не задано имя шаблона.

source: Some of fields in "workflow template name" field(s) don't exist.
de: Einige Felder im Feld "Workflow-Vorlagenname" existieren nicht.
ru: Некоторые поля в поле "имя шаблона процесса" не существуют.

source: If a "workflow template name" contains only an output fields,at least one of the fields must be required.
de: Wenn ein "Workflow-Vorlagenname" nur Ausgabefelder enthält, muss mindestens eines der Felder erforderlich sein.
ru: Если "имя шаблона процесса" содержит только значения полей, хотя бы одно из полей должно быть обязательным.

source: Kickoff form data not provided.
de: Formulardaten für den Start nicht bereitgestellt.
ru: Не предоставлены входные данные процесса.

source: Kickoff form 'id' has incorrect value.
de: Das Kickoff-Formular 'id' hat einen falschen Wert.
ru: Переданно неправильное значение поля 'id' для формы входных данных процесса.

source: Kickoff 'id' not provided.
de: Kickoff 'id' nicht angegeben.
ru: Не предоставлено поле 'id' для формы входных данных процесса.

source: Tasks data not provided, one task required.
de: Aufgabendaten nicht bereitgestellt, eine Aufgabe erforderlich.
ru: Данные о задачах не предоставлены, нужна, как минимум, одна задача.

source: Incorrect tasks order.
de: Falsche Aufgabenreihenfolge.
ru: Неправильный порядок задач.

source: You should set 'template owners' value.
de: Sie sollten den Wert für 'Vorlagenbesitzer' festlegen.
ru: Необходимо указать 'владельцев шаблона'.

source: You cannot remove yourself from template owners.
de: Sie können sich nicht selbst als Vorlagenbesitzer entfernen.
ru: Вы не можете удалить себя из владельцев шаблона.

source: One or more template owners are incorrect.
de: Ein oder mehrere Vorlagenbesitzer sind falsch.
ru: Один или несколько владельцев шаблона неверны.

source: "Public success url" is an invalid format.
de: „Öffentliche Erfolgs-URL“ ist ein ungültiges Format.
ru: Поле "Публичный URL успешного запуска процесса" имеет недопустимый формат.

source: Filters 'with_tasks_in_progress' and 'workflows_status'cannot be used at the same time.
de: Filter 'mit_aktuellen_Aufgaben' und 'workflow_Status' können nicht gleichzeitig verwendet werden.
ru: Фильтры 'with_tasks_in_progress' и 'workflows_status' не могут быть использованы одновременно

source: Permission denied. You are not a template owner.
de: Zugriff verweigert. Sie sind kein Vorlagenbesitzer.
ru: Доступ запрещен. Вы не являетесь владельцем шаблона.

source: Inconsistent permission! Should use only for "workflow detail" actions.
de: Inkonsistente Berechtigung! Sollte nur für "Workflow-Detail"-Aktionen verwendet werden.
ru: Противоречие в правах доступа! Следует использовать только для запросов к конкретному процессу.

source: The limit for creating a public id has been exceeded.
de: Das Limit für die Erstellung einer öffentlichen ID wurde überschritten.
ru: Превышен лимит на создание "публичного идентификатора" шаблона

source: The limit for creating a embed id has been exceeded.
de: Das Limit für die Erstellung einer Embed-ID wurde überschritten.
ru: Превышен лимит на создание "встраиваемого идентификатора" шаблона

source: Expected date field api_name.
de: Erwartetes Datumsfeld api_name.
ru: Ожидается api_name поля типа дата.

source: Only the date fields from previous steps can be used in a due date.
de: Nur die Datumsfelder aus den vorherigen Schritten können in einem Fälligkeitsdatum verwendet werden.
ru: Можно использовать только поля типа дата из предыдущих шагов в качестве Дедлайна.

source: Expected task api_name.
de: Erwartete Aufgabe api_name.
ru: Ожидается api_name задачи.

source: Only previous steps are allowed for a rule.
de: Nur vorherige Schritte sind für eine Regel zulässig.
ru: В правиле могут использоваться только предыдущие шаги.

source: Only previous and current steps are allowed for a rule.
de: Nur vorherige und aktuelle Schritte sind für eine Regel erlaubt.
ru: В правиле могут использоваться только предыдущие и текущий шаги.

source: You should set the user id for performer with the type "user".
de: Sie sollten die Benutzer-ID für den Ausführenden mit dem Typ "Benutzer" festlegen.
ru: Вы должны установить идентификатор пользователя для исполнителя с типом "user"

source: Performer "id" should be a number.
de: Der Wert von "id" sollte eine Zahl sein.
ru: Идентификатор исполнителя "id" должен быть числом.

source: One or more performers are incorrect.
de: Ein oder mehrere Ausführende sind falsch.
ru: Один или несколько исполнителей неверны.

source: A template with "Workflow starter" in the list of performers can not be shared. Please replace the "workflow starter" with another team member.
de: Eine Vorlage mit "Workflow-Starter" in der Liste der Ausführenden kann nicht freigegeben werden. Bitte ersetzen Sie den "Workflow-Starter" durch ein anderes Teammitglied.
ru: Шаблон с «Инициатором процесса» в списке исполнителей не может быть общедоступным. Пожалуйста, замените «инициатора процесса» другим членом команды.

source: You should set the field api_name for performer with the type "field".
de: Sie sollten das Feld api_name für den Ausführenden mit dem Typ "field" festlegen.
ru: Вы должны установить имя поля api для исполнителя с типом "field"

source: Step {number}: Some fields in the step description don't exist or are used before assignment.
de: Schritt {number}: Einige Felder in der Schrittbeschreibung existieren nicht oder werden vor der Zuweisung verwendet.
ru: Шаг {number}: Некоторые поля в описании шага не существуют или используются до назначения.

source: Step {number}: Field in step name don't exist or are used before assignment.
de: Schritt {number}: Feld im Schrittname existiert nicht oder wird vor der Zuweisung verwendet.
ru: Шаг {number}: Поле в имени шага не существует или используется до назначения.

source: Step {number}: If a step name contains only an output fields, at least one of the fields must be required.
de: Schritt {number}: Wenn ein Schrittname nur Ausgabefelder enthält, muss mindestens eines der Felder erforderlich sein.
ru: Шаг {number}: Если имя шага содержит только выходные поля, хотя бы одно из полей должно быть обязательным.

source: Checklist items not exists or invalid.
de: Checklistenpunkte existieren nicht oder sind ungültig.
ru: Пункты чек-листа не существуют или указанны некорректно.

source: You can't change api_name of an existing object. Old value: "{old}", new value: "{new}".
de: Sie können den api_name eines bestehenden Objekts nicht ändern. Alter Wert: "{old}", neuer Wert: "{new}".
ru: Вы не можете изменить api_name существующего объекта. Старое значеие: "{old}", новое значение: "{new}"

source: Task "{task}": user id "{user_id}" doesn't exist or can't be used in this condition.
de: Aufgabe "{task}": Benutzer-ID "{user_id}" existiert nicht oder kann unter diesen Bedingungen nicht verwendet werden.
ru: Задача "{task}": id пользователя "{user_id}" не существует или не может быть использовано в этом правиле.

source: Task "{task}": operator "{operator}" can't be use with type of field "{field_type}".
de: Aufgabe "{task}": Operator "{operator}" kann nicht mit dem Feldtyp "{field_type}" verwendet werden.
ru: Задача "{task}": оператор "{operator}" не может быть использован с типом поля "{field_type}".

source: Task "{task}": selection "{selection_api_name}" doesn't exist or can't be used in this condition.
de: Aufgabe "{task}": Auswahl "{selection_api_name}" existiert nicht oder kann in diesem Zustand nicht verwendet werden.
ru: Задача "{task}": значение поля "{selection_api_name}" не существует или не может быть использовано в этом правиле.

source: Task "{task}": operator "{operator}" should have some value.
de: Aufgabe "{task}": Der Operator "{operator}" sollte einen Wert haben.
ru: Задача "{task}": Требуется передать значение для выполнения действия с оператором "{operator}".

source: Step "{step_name}": checklist contains a non-unique api_name "{api_name}". Recreate checklist or change it's api_name.
de: Schritt "{step_name}": Checkliste enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie die Checkliste neu oder ändern Sie den api_name.
ru: Шаг "{step_name}": чек-лист содержит неуникальное имя API "{api_name}". Пересоздайте чек-лист или измените его имя API.

source: Step "{step_name}": checklist item contains a non-unique api_name "{api_name}". Recreate checklist item or change it's api_name.
de: Schritt "{step_name}": Checklistenpunkt enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie den Checklistenpunkt neu oder ändern Sie dessen api_name.
ru: Шаг "{step_name}": элемент чек-листа содержит неуникальное имя API "{api_name}". Пересоздайте элемент чек-листа или измените его имя API.

source: Step "{step_name}": condition contains a non-unique api_name "{api_name}". Recreate condition or change it's api_name.
de: Schritt "{step_name}": Bedingung enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie die Bedingung neu oder ändern Sie den api_name.
ru: Шаг "{step_name}": правило содержит неуникальное имя API "{api_name}". Пересоздайте правило или измените его имя API.

source: {step_name}: output field "{name}" contains a non-unique api_name "{api_name}". Change the api_name or recreate output field.
de: {step_name}: Das Ausgabefeld "{name}" enthält einen nicht eindeutigen api_name "{api_name}". Ändern Sie den api_name oder erstellen Sie das Ausgabefeld neu.
ru: {step_name}: выходное поле "{name}" содержит неуникальное имя API "{api_name}". Измените имя API или пересоздайте выходное поле.

source: Step "{step_name}": condition predicate contains a non-unique api_name "{api_name}". Recreate condition predicate or change it's api_name.
de: Schritt "{step_name}": Bedingungsprädikat enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie das Bedingungsprädikat neu oder ändern Sie den api_name.
ru: Шаг "{step_name}": условный предикат содержит неуникальное имя API "{api_name}". Пересоздайте условный предикат или измените его имя API.

source: Step "{step_name}": due date contains a non-unique api_name "{api_name}". Recreate due date or change it's api_name.
de: Schritt "{step_name}": Das Fälligkeitsdatum enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie das Fälligkeitsdatum neu oder ändern Sie den api_name.
ru: Шаг "{step_name}": дата выполнения содержит неуникальное имя API "{api_name}". Пересоздайте дату выполнения или измените имя API.

source: Step "{step_name}": condition rule contains a non-unique api_name "{api_name}". Recreate condition rule or change it's api_name.
de: Schritt "{step_name}": Die Bedingungsregel enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie die Bedingungsregel neu oder ändern Sie den api_name.
ru: Шаг "{step_name}": правило содержит неуникальное имя API "{api_name}". Пересоздайте правило или измените его имя API.

source: {step_name}: output field "{name}" option "{value}" contains a non-unique api_name "{api_name}". Change the api_name or recreate option.
de: {step_name}: Ausgabefeld "{name}" Option "{value}" enthält einen nicht eindeutigen api_name "{api_name}". Ändern Sie den api_name oder erstellen Sie die Option neu.
ru: {step_name}: выходное поле "{name}" опция "{value}" содержит неуникальное api_name "{api_name}". Измените api_name или пересоздайте опцию.

source: Step "{step_name}": contains a non-unique api_name "{api_name}". Recreate step or change it's api_name.
de: Schritt "{step_name}": enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie den Schritt neu oder ändern Sie seinen api_name.
ru: Шаг "{step_name}": содержит неуникальное api_name "{api_name}". Пересоздайте шаг или измените его api_name.

source: Step "{step_name}": performer contains a non-unique api_name "{api_name}". Recreate performer or change it's api_name.
de: Schritt "{step_name}": Der Ausführende enthält einen nicht eindeutigen api_name "{api_name}". Erstellen Sie den Ausführenden neu oder ändern Sie seinen api_name.
ru: Шаг "{step_name}": исполнитель содержит неуникальный api_name "{api_name}". Создайте исполнителя заново или измените его api_name.

source: Duplicate template owners in the add owners request.
de: Doppelte Vorlagenbesitzer in der Anfrage zum Hinzufügen von Besitzern.
ru: Дублирующиеся владельцы шаблона в запросе на добавление владельцев.

source: The owners passed in for template "{step_name}" contain a non-unique api_name: "{api_name}". Please change the non-unique api_name, or supply different owners.
de: Die für die Vorlage "{step_name}" übermittelten Besitzer enthalten einen nicht eindeutigen api_name: "{api_name}". Bitte ändern Sie den nicht eindeutigen api_name oder fügen Sie andere Besitzer hinzu.
ru: Владельцы, переданные для шаблона "{step_name}", содержат неуникальный api_name: "{api_name}". Пожалуйста, измените неуникальный api_name или укажите других владельцев.

source: Saving files is not available, file storage does't configured. Contact support.
de: Speichern von Dateien ist nicht verfügbar, Dateispeicher ist nicht konfiguriert. Kontaktieren Sie den Support.
ru: Невозможно сохранить файл, Файловое хранилище не настроенно. Обратитесь в поддержку.

source: Only "snoozed" workflows can be resumed.
de: Nur "schlummernde" Workflows können fortgesetzt werden.
ru: Только «отложенные» процессы могут быть возобновлены

source: You need to resume the workflow before completing the task.
de: Sie müssen den Arbeitsablauf fortsetzen, bevor Sie die Aufgabe abschließen.
ru: Вам нужно возобновить процесс перед выполнением задачи.

source: Task is skipped and cannot be completed.
de: Aufgabe wird übersprungen und kann nicht abgeschlossen werden.
ru: Пропущенная задача не может быть завершена.

source: Check off all the items in the checklist before completing the task.
de: Markieren Sie alle Punkte auf der Checkliste, bevor Sie die Aufgabe abschließen.
ru: Отметьте все элементы в чек-листе, прежде чем завершить задачу.

source: You have already completed this task.
de: Sie haben diese Aufgabe bereits abgeschlossen.
ru: Вы уже завершили эту задачу.

source: You have already completed this workflow.
de: Sie haben diesen Arbeitsablauf bereits abgeschlossen.
ru: Вы уже завершили этот процесс.

source: You are not allowed to finish this workflow.
de: Sie dürfen diesen Workflow nicht abschließen.
ru: У вас нет прав для завершения данного процесса.

source: Task already completed.
de: Aufgabe bereits abgeschlossen.
ru: Задача уже завершена.

source: You don't have permission for complete the task.
de: Sie haben keine Berechtigung, um die Aufgabe zu erledigen.
ru: У вас нет прав для завершения задачи.

source: The supplied task number is incorrect.
de: Die angegebene Auftragsnummer ist falsch.
ru: Предоставлен неверный номер задачи.

source: The user with the specified credentials not found.
de: Der Benutzer mit den angegebenen Anmeldeinformationen wurde nicht gefunden.
ru: Пользователь с указанными учетными данными не найден.

source: You have reached the limit of the number of guest performers.
de: Sie haben die Höchstzahl an Gastkünstlern erreicht.
ru: Вы достигли лимита числа гостей.

source: Deleting the last performer is not allowed.
de: Das Löschen des letzten Ausführenden ist nicht zulässig.
ru: Последний исполнитель не может быть удален.

source: Completed workflow cannot be changed.
de: Abgeschlossener Workflow kann nicht geändert werden.
ru: Завершенный процесс не может быть изменен.

source: Available for current task only.
de: Verfügbar nur für die aktuelle Aufgabe.
ru: Доступно только для текущей задачи.

source: You need to be added to the task as a performer to check off this checklist item.
de: Sie müssen als Ausführender zur Aufgabe hinzugefügt werden, um diesen Checklistenpunkt abzuhaken.
ru: Вы должны быть добавлены к задаче как исполнитель, чтобы отметить этот элемент чек-листа.

source: You need to resume the workflow before check off this checklist item.
de: Sie müssen den Arbeitsablauf fortsetzen, bevor Sie diesen Checklistenpunkt abhaken.
ru: Вам нужно возобновить процесс, прежде чем отмечать этот элемент чек-листа.

source: Permission denied.
de: Zugriff verweigert.
ru: Доступ запрещен.

source: Filters 'with_tasks_in_progress' and 'is_running_workflows' cannot be used at the same time.
de: Filter 'with_tasks_in_progress' und 'is_running_workflows' können nicht gleichzeitig verwendet werden.
ru: Фильтры 'with_tasks_in_progress' и 'is_running_workflows' не могут быть использованы одновременно.

source: Please fill in the required fields.
de: Bitte füllen Sie die erforderlichen Felder aus.
ru: Пожалуйста, заполните обязательные поля.

source: Wrong argument format: "{arg}".
de: Falsches Argumentformat: "{arg}".
ru: Неверный формат аргумента: "{arg}".

source: Value should be a string.
de: Wert sollte eine Zeichenkette sein.
ru: Значение должно быть строкой.

source: The value of the field exceeds the limit of {limit} characters.
de: Der Wert des Feldes überschreitet das Limit von {limit} Zeichen.
ru: Значение поля превысило лимит в {limit} символов.

source: Selection with the given id does not exist.
de: Auswahl mit der angegebenen ID existiert nicht.
ru: Значение поля с указнным id не существует.

source: Checkbox value should be a list.
de: Kontrollkästchenwert sollte eine Liste sein.
ru: Значение поля "чекбокс" должно быть списоком.

source: Checkbox value contains invalid selections.
de: Checkbox-Wert enthält ungültige Auswahlen.
ru: В поле "чекбокс" указазны некорректные значения

source: Checkbox value contains non existent selections.
de: Checkbox-Wert enthält nicht existierende Auswahlen.
ru: В поле "чекбокс" выбраны несуществующие значения.

source: The date value must be an integer or a floating-point number.
de: Der Datumswert muss eine ganze Zahl oder eine Gleitkommazahl sein.
ru: Значение даты должно быть целым числом или с плавающей запятой.

source: URL field value should be a string.
de: Der Wert des URL-Feldes muss eine Zeichenkette sein.
ru: Значение в поле "URL" должно быть строкой.

source: The URL is invalid.
de: Die URL ist ungültig.
ru: Указан некорректный URL.

source: File value should be a list of integers.
de: Dateiwert sollte eine Liste von ganzen Zahlen sein.
ru: Значение поля "Файл" должно быть массивом целых чисел.

source: Attachment not found.
de: Anhang nicht gefunden.
ru: Вложение не найдено.

source: The value must be the ID of an existing account user.
de: Der Wert muss die ID eines bestehenden Kontobenutzers sein.
ru: Значение должно быть идентификатором существующего пользователя.

source: Account user with given id does not exist.
de: Kontobenutzer mit der angegebenen ID existiert nicht.
ru: Пользователь с данным идентификатором не существует в данной учетной записи.

source: Save attachments failed. Service unavailable.
de: Speichern der Anhänge fehlgeschlagen. Dienst nicht verfügbar.
ru: Сохранение вложения невозможно. Сервис недоступен.

source: Blob object doesn't exist.
de: Blob-Objekt existiert nicht.
ru: Объект "Blob" не существует.

source: AI service is temporarily unavailable.
de: Der AI-Dienst ist vorübergehend nicht verfügbar.
ru: ИИ сервис временно недоступен.

source: Could not create template from given description.
de: Vorlage konnte nicht aus der angegebenen Beschreibung erstellt werden.
ru: Не удалось создать шаблон из данного описания.

source: You've reached the limit for free AI powered template generation requests, sign up for a premium account to get unlimited access.
de: Sie haben das Limit für kostenlose KI-gestützte Vorlagenerstellungsanfragen erreicht. Melden Sie sich für ein Premium-Konto an, um unbegrenzten Zugriff zu erhalten.
ru: Вы достигли лимита бесплатных запросов на генерацию шаблонов с помощью ИИ, подпишитесь на премиум-аккаунт для получения неограниченного доступа.

source: Something seems to be wrong with your input, please try re phrasing your process name and description.
de: Etwas scheint mit Ihrer Eingabe nicht zu stimmen. Bitte versuchen Sie, den Namen und die Beschreibung Ihres Prozesses neu zu formulieren.
ru: Что-то не так с вашим промытом, пожалуйста, попробуйте переформулировать название и описание вашего процесса

source: You need to set up a system prompt for template generation. Contact administrator.
de: Sie müssen eine Systemaufforderung für die Vorlagenerstellung einrichten. Kontaktieren Sie den Administrator.
ru: Необходимо настроить системный запрос для генерации шаблона. Свяжитесь с администратором.

source: You need to specify the comment text or attachments.
de: Sie müssen den Kommentartext oder Anhänge angeben.
ru: Необходимо указать текст или вложение комментария.

source: You cannot write a comment on a completed workflow.
de: Sie können keinen Kommentar zu einem abgeschlossenen Workflow schreiben.
ru: Вы не можете написать комментарий к завершенному процессу.

source: You cannot change a deleted comment.
de: Sie können einen gelöschten Kommentar nicht ändern.
ru: Вы не можете изменить удаленный комментарий.

source: The size limit for attachments is {mb} Mb.
de: Die Größenbeschränkung für Anhänge beträgt {mb} MB.
ru: Лимит размера вложений составляет {mb} Мб.

source: Due date should be greater than current.
de: Fälligkeitsdatum sollte später als das aktuelle Datum sein.
ru: Дата выполнения должна быть больше текущей.

source: Field with type "User" should be required.
de: Feld mit dem Typ "Benutzer" sollte erforderlich sein.
ru: Поле с типом "User" должно быть обязательным.

source: The default value for a field with type "User" should be an integer.
de: Der Standardwert für ein Feld vom Typ "Benutzer" sollte eine ganze Zahl sein.
ru: Значение по умолчанию для поля с типом "User" должно быть целым числом.

source: The user for a field with type "User" does not exist.
de: Der Benutzer für ein Feld vom Typ "Benutzer" existiert nicht.
ru: Не найден пользователь указанный в поле с типом "User".

source: Field selections not provided.
de: Feldauswahlen nicht angegeben.
ru: Элементы поля не указаны.

source: Checklist element length limit exceeded. Limit 2000 chars.
de: Checklisten-Element-Längenlimit überschritten. Limit 2000 Zeichen.
ru: Превышен лимит длины элемента чек-листа. Лимит 2000 символов.

source: Filter by "assigned_to" is only allowed for the admin.
de: Filtern nach "assigned_to" ist nur für den Administrator erlaubt.
ru: Фильтр по "assigned_to" разрешен только для роли администратора.
